---
kind: property
id: P:Autodesk.Revit.DB.Category.CanAddSubcategory
source: html/b785e56e-97c6-88d4-fcc9-05a1169d675b.htm
---
# Autodesk.Revit.DB.Category.CanAddSubcategory Property

Indicates if subcategories can be assigned to the category.

## Syntax (C#)
```csharp
public bool CanAddSubcategory { get; }
```